Store2/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ('jeans', '2025-06-08 12:41:22.140229', '2025-06-08 12:41:22.140229') RETURNING "id"
---
  def create
      @product = Product.new(product_params)
      if @product.save

UPDATE "products" SET "name" = 'Sweat Pants', "updated_at" = '2025-06-08 12:50:09.702095' WHERE "products"."id" = 1
---
  def update
    if @product.update(product_params)